app/views/groups/edit.html.erb

SELECT "users".* FROM "users"
---
      <%= f.label :introduction, '紹介文' %>
      <%= f.collection_check_boxes :user_ids, User.all, :id, :name %>