app/controllers/groups_controller.rb

    def index
        @group_lists = Group.all
        @group_joining = GroupUser.where(user_id: current_user.id)
---
SELECT "groups".* FROM "groups"
SELECT "group_users".* FROM "group_users" WHERE "group_users"."user_id" = ?  [["user_id", 4]]
SELECT "users"."id" FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = ?  [["group_id", 1]]

    def new
        @group = Group.new
        @group.users << current_user
---
INSERT INTO "group_users" ("group_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_id", 1], ["user_id", 1], ["created_at", "2021-06-09 07:25:55.047975"], ["updated_at", "2021-06-09 07:25:55.047975"]]

    def create
        @group = Group.new(group_params)
        if @group.save
---
INSERT INTO "groups" ("name", "introduction", "image_id", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "べべ"], ["introduction", "べべ"], ["image_id", nil], ["owner_id", 4], ["created_at", "2021-06-10 08:57:36.521003"], ["updated_at", "2021-06-10 08:57:36.521003"]]

    def update
        @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def destroy
        delete_group = Group.find(params[:id])
        if delete_group.destroy
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 2]]